src/cf/Documents/ExpenseByLimits.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ExpenseByLimits</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.TurnoverByEmployeeLimits</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Employee</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoIndividuals</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Entity</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCompanies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LimitsForEmployees</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>TypeOfLimit</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.TypesOfLimitsForEmployees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Stage</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.StageOfLimitsForEmployees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Limit</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ExpenseByLimits/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// EVENT HANDLERS

#Region EventHandlers

Procedure Filling(FillingData, StandardProcessing) Export

	If FillingData = Undefined Then // Create a new item.
		_DemoStandardSubsystems.OnEnterNewItemFillCompany(ThisObject, "Entity");
	EndIf;

EndProcedure // Filling()

Procedure FillCheckProcessing(Cancel, CheckedAttributes)

	arrTypeOfLimit = LimitsForEmployees.UnloadColumn("TypeOfLimit");
	mapTypeOfLimitOneTime = Common.ObjectsAttributeValue(arrTypeOfLimit, "OneTime");
	
	For Each LimitsForEmployeesRow In LimitsForEmployees Do

		If ValueIsFilled(LimitsForEmployeesRow.TypeOfLimit)
			And Not mapTypeOfLimitOneTime[LimitsForEmployeesRow.TypeOfLimit]
			And Not ValueIsFilled(LimitsForEmployeesRow.Stage) Then

			TextTemplate = NStr("ru = 'В строке %1 табличной части ""Лимиты"" не заполнено значение периода (этапа).';
								|en = 'Stage value on row %1 of table ""Lumits"" not filled.'");

			CommonClientServer.MessageToUser(
				StrTemplate(TextTemplate, LimitsForEmployeesRow.LineNumber),,
				StrTemplate("LimitsForEmployees[%1].Stage", LimitsForEmployees.IndexOf(LimitsForEmployeesRow)),
				"Object",
				Cancel);		
		EndIf;
	EndDo;

EndProcedure // FillCheckProcessing() 

Procedure Posting(Cancel, PostingMode)

	// Initialization of additional properties for document posting.
	DocumentPosting.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);

	// Initialization of document data.
	LimitsForEmployeesServer.DataInitializationDocument(Ref, AdditionalProperties);

	// Prepare recordsets.
	DocumentPosting.PrepareRecordSetsForRecording(ThisObject);

	// Reflect in accounting sections.
	LimitsForEmployeesServer.ReflectRecordsByEmployeeLimits(AdditionalProperties, RegisterRecords, Cancel);

	// Write recordsets.
	DocumentPosting.WriteRecordSets(ThisObject);

	AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();

EndProcedure

Procedure OnSetNewNumber(StandardProcessing, Prefix)

	Prefix = "A";

EndProcedure

#EndRegion
